lepton-phlb/lepton/sys/user/tauon_sampleapp/hal/board_freescale_twrk60n512/lib/install/include/pkgconf/hal_cortexm_kinetis.h
#ifndef CYGONCE_PKGCONF_HAL_CORTEXM_KINETIS_H
#define CYGONCE_PKGCONF_HAL_CORTEXM_KINETIS_H
/*
 * File <pkgconf/hal_cortexm_kinetis.h>
 *
 * This file is generated automatically by the configuration
 * system. It should not be edited. Any changes to this file
 * may be overwritten.
 */

#define CYGHWR_HAL_CORTEXM_KINETIS MK60DN512
#define CYGHWR_HAL_CORTEXM_KINETIS_MK60DN512
#define CYGHWR_HAL_CORTEXM_KINETIS_SUBFAM 60
#define CYGHWR_HAL_CORTEXM_KINETIS_SUBFAM_60
#define CYGHWR_HAL_CORTEXM_KINETIS_FLASH_NAME 512
#define CYGHWR_HAL_CORTEXM_KINETIS_FLASH_NAME_512
#define CYGNUM_HAL_CORTEXM_PRIORITY_LEVEL_BITS 4
#define CYGNUM_HAL_CORTEXM_PRIORITY_LEVEL_BITS_4
#define CYGNUM_HAL_CORTEXM_KINETIS_MCGOUT_FREQ_SP 96000000
#define CYGNUM_HAL_CORTEXM_KINETIS_MCGOUT_FREQ_SP_96000000
#define CYGNUM_HAL_CORTEXM_KINETIS_MCGOUT_FREQ 96000000
#define CYGNUM_HAL_CORTEXM_KINETIS_MCGOUT_FREQ_96000000
#define CYGOPT_HAL_CORTEXM_KINETIS_MCG_MCGOUTCLK PLL
#define CYGOPT_HAL_CORTEXM_KINETIS_MCG_MCGOUTCLK_PLL
#define CYGOPT_HAL_CORTEXM_KINETIS_MCG_REF_EXT_IS OSC
#define CYGOPT_HAL_CORTEXM_KINETIS_MCG_REF_EXT_IS_OSC
#define CYGHWR_HAL_CORTEXM_KINETIS_MCG_REF_EXT_FREQ 50000000
#define CYGHWR_HAL_CORTEXM_KINETIS_MCG_REF_EXT_FREQ_50000000
#define CYGNUM_HAL_CORTEXM_KINETIS_MCG_FLL_PLL_FREQ_SP 96000000
#define CYGNUM_HAL_CORTEXM_KINETIS_MCG_FLL_PLL_FREQ_SP_96000000
#define CYGOPT_HAL_CORTEXM_KINETIS_MCG_FLL_PLL_REFSRC EXT_REFCLK
#define CYGOPT_HAL_CORTEXM_KINETIS_MCG_FLL_PLL_REFSRC_EXT_REFCLK
#define CYGNUM_HAL_CORTEXM_KINETIS_MCG_FLL_PLL_REF_FREQ 50000000
#define CYGNUM_HAL_CORTEXM_KINETIS_MCG_FLL_PLL_REF_FREQ_50000000
#define CYGNUM_HAL_CORTEXM_KINETIS_MCG_REF_FREQ_RANGE 2
#define CYGNUM_HAL_CORTEXM_KINETIS_MCG_REF_FREQ_RANGE_2
#define CYGNUM_HAL_CORTEXM_KINETIS_MCG_REF_FRDIV 48
#define CYGNUM_HAL_CORTEXM_KINETIS_MCG_REF_FRDIV_48
#define CYGNUM_HAL_CORTEXM_KINETIS_MCG_REF_FRDIV_REG 5
#define CYGNUM_HAL_CORTEXM_KINETIS_MCG_REF_FRDIV_REG_5
#define CYGNUM_HAL_CORTEXM_MCG_DCO_DRST_DRS 3
#define CYGNUM_HAL_CORTEXM_MCG_DCO_DRST_DRS_3
#define CYGNUM_HAL_CORTEXM_MCG_DCO_DMX32 0x00000080
#define CYGNUM_HAL_CORTEXM_MCG_DCO_DMX32_0x00000080
#define CYGNUM_HAL_CORTEXM_MCG_DCO_FLL_FACT 2929
#define CYGNUM_HAL_CORTEXM_MCG_DCO_FLL_FACT_2929
#define CYGNUM_HAL_CORTEXM_KINETIS_MCG_DCO_IN 156250
#define CYGNUM_HAL_CORTEXM_KINETIS_MCG_DCO_IN_156250
#define CYGNUM_HAL_CORTEXM_KINETIS_MCG_FLL_FREQ_AV 457656250
#define CYGNUM_HAL_CORTEXM_KINETIS_MCG_FLL_FREQ_AV_457656250
#define CYGOPT_HAL_CORTEXM_KINETIS_MCGOUT_PLL_PRDIV 25
#define CYGOPT_HAL_CORTEXM_KINETIS_MCGOUT_PLL_PRDIV_25
#define CYGOPT_HAL_CORTEXM_KINETIS_MCGOUT_PLL_VDIV 48
#define CYGOPT_HAL_CORTEXM_KINETIS_MCGOUT_PLL_VDIV_48
#define CYGNUM_HAL_CORTEXM_KINETIS_MCG_PLL_FREQ_AV 96000000
#define CYGNUM_HAL_CORTEXM_KINETIS_MCG_PLL_FREQ_AV_96000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_PER_BUS 48000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_PER_BUS_48000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_PER_MAX 50000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_PER_MAX_50000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_PER_BUS_SP 50000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_PER_BUS_SP_50000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLKDIV_PER_BUS 2
#define CYGHWR_HAL_CORTEXM_KINETIS_CLKDIV_PER_BUS_2
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_FLASH 24000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_FLASH_24000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_FLASH_MAX 25000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_FLASH_MAX_25000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_FLASH_SP 25000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_FLASH_SP_25000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLKDIV_FLASH 4
#define CYGHWR_HAL_CORTEXM_KINETIS_CLKDIV_FLASH_4
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_FLEX_BUS 48000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_FLEX_BUS_48000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_FLEX_BUS_MAX 50000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_FLEX_BUS_MAX_50000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_FLEX_BUS_SP 50000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_FLEX_BUS_SP_50000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLKDIV_FLEX_BUS 2
#define CYGHWR_HAL_CORTEXM_KINETIS_CLKDIV_FLEX_BUS_2
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_USB 48000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_USB_48000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_USB_MAX 48000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_USB_MAX_48000000
#define CYGHWR_HAL_CORTEXM_KINETIS_USBCLK_FRAC 1
#define CYGHWR_HAL_CORTEXM_KINETIS_USBCLK_FRAC_1
#define CYGHWR_HAL_CORTEXM_KINETIS_USBCLK_DIV 2
#define CYGHWR_HAL_CORTEXM_KINETIS_USBCLK_DIV_2
#define CYGNUM_HAL_CORTEXM_KINETIS_CLK_USB_IN 96000000
#define CYGNUM_HAL_CORTEXM_KINETIS_CLK_USB_IN_96000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_USB_SP 48000000
#define CYGHWR_HAL_CORTEXM_KINETIS_CLK_USB_SP_48000000
#define CYGHWR_HAL_CORTEXM_KINETIS_TRACECLK CORE
#define CYGHWR_HAL_CORTEXM_KINETIS_TRACECLK_CORE
#define CYGINT_HAL_CORTEXM_KINETIS_RTC 1
#define CYGINT_HAL_CORTEXM_KINETIS_RTC_1
#define CYGHWR_HAL_CORTEXM_KINETIS_RTC 1
#define CYGHWR_HAL_CORTEXM_KINETIS_RTC_OSC_CAP 20
#define CYGHWR_HAL_CORTEXM_KINETIS_RTC_OSC_CAP_20
#define CYGNUM_HAL_KERNEL_COUNTERS_CLOCK_ISR_DEFAULT_PRIORITY 0x000000E0
#define CYGNUM_HAL_KERNEL_COUNTERS_CLOCK_ISR_DEFAULT_PRIORITY_0x000000E0
#define CYGNUM_HAL_RTC_NUMERATOR 1000000000
#define CYGNUM_HAL_RTC_NUMERATOR_1000000000
#define CYGNUM_HAL_RTC_DENOMINATOR 100
#define CYGNUM_HAL_RTC_DENOMINATOR_100
#define CYGNUM_HAL_RTC_PERIOD 10000
#define CYGNUM_HAL_RTC_PERIOD_10000
#define CYGHWR_HAL_CORTEXM_KINETIS_SRAM_UNIFIED 1
#define CYGHWR_HAL_CORTEXM_KINETIS_FLASH_KIB 512
#define CYGHWR_HAL_CORTEXM_KINETIS_FLASH_KIB_512
#define CYGHWR_HAL_CORTEXM_KINETIS_SRAM_KIB 128
#define CYGHWR_HAL_CORTEXM_KINETIS_SRAM_KIB_128
#define CYGHWR_HAL_KINETIS_FLASH_SIZE 0x00080000
#define CYGHWR_HAL_KINETIS_FLASH_SIZE_0x00080000
#define CYGHWR_HAL_KINETIS_SRAM_SIZE 0x00020000
#define CYGHWR_HAL_KINETIS_SRAM_SIZE_0x00020000
#define CYGHWR_HAL_KINETIS_SRAM_BANK_SIZE 0x00010000
#define CYGHWR_HAL_KINETIS_SRAM_BANK_SIZE_0x00010000
#define CYGHWR_HAL_KINETIS_FLEXNVM_FLASH_SIZE 0x00080000
#define CYGHWR_HAL_KINETIS_FLEXNVM_FLASH_SIZE_0x00080000
#define CYGINT_HAL_FREESCALE_UART3 1

#endif
